pages/3_Lesson.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Web Design</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Xiaohui Ellis" />
<link rel="stylesheet" type="text/css" href="css/styles.css"/>
<link href='http://fonts.googleapis.com/css?family=Ubuntu+Mono|Ubuntu' rel='stylesheet' type='text/css'>
</head>
<body>
<div id="content">
<h1 class="title">Web Design</h1>
  <div class="github-fork-ribbon-wrapper left">
    <div class="github-fork-ribbon">
      <a href="https://github.com/digixc/7-CS-IndependentWebDev">Fork me on GitHub</a>
    </div>
  </div>
<div id="stickyribbon">
    <ul>
      <li><a href="1_Lesson.html">Week1</a></li>
      <li><a href="2_Lesson.html">Week2</a></li>
      <li><a href="3_Lesson.html">Week3</a></li>
      <li><a href="4_Lesson.html">Week4</a></li>
      <li><a href="Homework.html">homework</a></li>
    </ul>
  </div>

<div id="outline-container-sec-1" class="outline-2 activity">
<h2 id="sec-1">Self Progress Checking</h2>
<div class="outline-text-2" id="text-1">
</div>

<div id="outline-container-sec-1-1" class="outline-3 badge">
<h3 id="sec-1-1">Badge It - The DIVs</h3>
<div class="outline-text-3" id="text-1-1">

<ul class="org-ul">
<li>There is a <a href="./img/Wrapper-topbox-container.mp4">video tutorial</a> here about creating a wrapper, a topbox and a container you may find it useful to help you get started. 
</li>
<li>There is <a href="./img/leftbox-twoRightboxes.mp4">another video tutorial</a> here about creating left and right boxes/DIVs inside a container.
</li>
<li>Once you have created the general layout and tested your webpage is working as intended, click <a href="https://www.bournetolearn.com/quizzes/y7-webIndDev/Lesson_2/index.php">here</a> for the self assessment. You will be awarded <b>Silver</b>, <b>Gold</b> and/or <b>Platinum</b> badges based on your progress.
</li>
<li>You can always come back here to re-take the assessment quiz once you have finished the task.
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-1-2" class="outline-3 badge">
<h3 id="sec-1-2">Badge It - Links and Images</h3>
<div class="outline-text-3" id="text-1-2">

<ul class="org-ul">
<li>Once you have created the general layout and tested your webpage is working as intended, then you will add links and images as you have planned in your design.
</li>
<li>There is a video tutrial on <a href="./img/background-images.mp4">how to use images as background</a> in your DIVs.
</li>
<li>This video tutorial (coming soon) is on how to style hyperlinks so when hoverover, they change colour.
</li>
<li>This video tutorial (coming soon) is on how to style the links so they appear in a line with a vertical bar between them.
</li>
<li>Click <a href="https://www.bournetolearn.com/quizzes/y7-webIndDev/Lesson_3/index.php">here</a> for the self assessment. You will be awarded <b>Silver</b>, <b>Gold</b> , <b>Platinum</b> badges based on your progress.
</li>
<li>You can always come back here to re-take the assessment quiz once you 
have finished the task.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3 badge">
<h3 id="sec-1-3">Badge It - The Finer Touches</h3>
<div class="outline-text-3" id="text-1-3">

<ul class="org-ul">
<li>There is a video tutorial(coming soon) on how to style your webpages to make it look amazing by adding border styles, shadows, padding, and margins.
</li>
<li>Once you have created the general layout and tested your webpage is working as intended, click <a href="https://www.bournetolearn.com/quizzes/y7-webIndDev/Lesson_4/index.php">here</a> for the self assessment. You will be awarded <b>Gold</b>,and/or <b>Platinum</b> badges based on your progress.
</li>
<li>You can always come back here to re-take the assessment quiz once you have finished the task.
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Xiaohui Ellis</p>
<p class="validation"></p>
</div>
</body>
</html>
